; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v2 ?v11)
             (pred_11 ?v4 ?v9)
             (pred_1 ?v2 ?v9)
             (pred_2 ?v1 ?v2 )
	     (pred_8 ?v2)
             (pred_4 ?v5)
             (pred_7 ?v4)
             (pred_3 ?v9)
             (pred_9 ?v2)
             (pred_12 ?v4)
             (pred_5 ?v2)
             (pred_6 ))



(:action op_3
:parameters (?v8 ?v10 ?v7 ?v13)
:precondition (and (pred_4 ?v8) (pred_4 ?v10) (pred_7 ?v7) (pred_3 ?v13)
          (pred_10 ?v8 ?v10) (pred_11 ?v7 ?v13)
                   (pred_1 ?v10 ?v13) (pred_8 ?v8) 
                   (pred_9 ?v10) (pred_12 ?v7))
:effect (and  (pred_5 ?v10) (not (pred_9 ?v10))))


(:action op_5
:parameters (?v8 ?v6)
:precondition (and (pred_4 ?v8) (pred_4 ?v6)
               (pred_8 ?v8) (pred_10 ?v8 ?v6) (pred_5 ?v6))
:effect (and (pred_8 ?v6) (not (pred_8 ?v8))))

(:action op_2
:parameters (?v8 ?v7)
:precondition (and (pred_4 ?v8) (pred_7 ?v7) 
                  (pred_8 ?v8) (pred_2 ?v7 ?v8) (pred_6 ))
:effect (and (pred_12 ?v7)
   (not (pred_2 ?v7 ?v8)) (not (pred_6 ))))


(:action op_1
:parameters (?v8 ?v3 ?v12)
:precondition (and (pred_4 ?v8) (pred_7 ?v3) (pred_7 ?v12)
                  (pred_8 ?v8) (pred_12 ?v12) (pred_2 ?v3 ?v8))
:effect (and (pred_12 ?v3) (pred_2 ?v12 ?v8)
        (not (pred_12 ?v12)) (not (pred_2 ?v3 ?v8))))

(:action op_4
:parameters (?v8 ?v7)
:precondition (and (pred_4 ?v8) (pred_7 ?v7) 
                  (pred_8 ?v8) (pred_12 ?v7))
:effect (and (pred_6 ) (pred_2 ?v7 ?v8) (not (pred_12 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_01 obj_29 obj_23 obj_09 obj_04 obj_08 obj_10 obj_16 obj_27 obj_02 obj_25 obj_20 obj_03 obj_12 obj_18 obj_30 obj_19 obj_28 obj_15 obj_21 obj_17 obj_26 obj_06 obj_07
    obj_13 obj_05
    obj_22 obj_24 obj_11
    )

    (:init
       (pred_6)

       (pred_4 obj_14)
       (pred_4 obj_01)
       (pred_4 obj_29)
       (pred_4 obj_23)
       (pred_4 obj_09)
       (pred_4 obj_04)
       (pred_4 obj_08)
       (pred_4 obj_10)
       (pred_4 obj_16)
       (pred_4 obj_27)
       (pred_4 obj_02)
       (pred_4 obj_25)
       (pred_4 obj_20)
       (pred_4 obj_03)
       (pred_4 obj_12)
       (pred_4 obj_18)
       (pred_4 obj_30)
       (pred_4 obj_19)
       (pred_4 obj_28)
       (pred_4 obj_15)
       (pred_4 obj_21)
       (pred_4 obj_17)
       (pred_4 obj_26)
       (pred_4 obj_06)
       (pred_4 obj_07)
       (pred_3 obj_13)
       (pred_3 obj_05)
       (pred_7 obj_22)
       (pred_7 obj_24)
       (pred_7 obj_11)

       (pred_10 obj_14 obj_04)
       (pred_10 obj_14 obj_01)
       (pred_10 obj_01 obj_08)
       (pred_10 obj_01 obj_29)
       (pred_10 obj_01 obj_14)
       (pred_10 obj_29 obj_10)
       (pred_10 obj_29 obj_23)
       (pred_10 obj_29 obj_01)
       (pred_10 obj_23 obj_16)
       (pred_10 obj_23 obj_09)
       (pred_10 obj_23 obj_29)
       (pred_10 obj_09 obj_27)
       (pred_10 obj_09 obj_23)
       (pred_10 obj_04 obj_02)
       (pred_10 obj_04 obj_08)
       (pred_10 obj_04 obj_14)
       (pred_10 obj_08 obj_25)
       (pred_10 obj_08 obj_10)
       (pred_10 obj_08 obj_01)
       (pred_10 obj_08 obj_04)
       (pred_10 obj_10 obj_20)
       (pred_10 obj_10 obj_16)
       (pred_10 obj_10 obj_29)
       (pred_10 obj_10 obj_08)
       (pred_10 obj_16 obj_03)
       (pred_10 obj_16 obj_27)
       (pred_10 obj_16 obj_23)
       (pred_10 obj_16 obj_10)
       (pred_10 obj_27 obj_12)
       (pred_10 obj_27 obj_09)
       (pred_10 obj_27 obj_16)
       (pred_10 obj_02 obj_18)
       (pred_10 obj_02 obj_25)
       (pred_10 obj_02 obj_04)
       (pred_10 obj_25 obj_30)
       (pred_10 obj_25 obj_20)
       (pred_10 obj_25 obj_08)
       (pred_10 obj_25 obj_02)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_20 obj_03)
       (pred_10 obj_20 obj_10)
       (pred_10 obj_20 obj_25)
       (pred_10 obj_03 obj_28)
       (pred_10 obj_03 obj_12)
       (pred_10 obj_03 obj_16)
       (pred_10 obj_03 obj_20)
       (pred_10 obj_12 obj_15)
       (pred_10 obj_12 obj_27)
       (pred_10 obj_12 obj_03)
       (pred_10 obj_18 obj_21)
       (pred_10 obj_18 obj_30)
       (pred_10 obj_18 obj_02)
       (pred_10 obj_30 obj_17)
       (pred_10 obj_30 obj_19)
       (pred_10 obj_30 obj_25)
       (pred_10 obj_30 obj_18)
       (pred_10 obj_19 obj_26)
       (pred_10 obj_19 obj_28)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_19 obj_30)
       (pred_10 obj_28 obj_06)
       (pred_10 obj_28 obj_15)
       (pred_10 obj_28 obj_03)
       (pred_10 obj_28 obj_19)
       (pred_10 obj_15 obj_07)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_15 obj_28)
       (pred_10 obj_21 obj_17)
       (pred_10 obj_21 obj_18)
       (pred_10 obj_17 obj_26)
       (pred_10 obj_17 obj_30)
       (pred_10 obj_17 obj_21)
       (pred_10 obj_26 obj_06)
       (pred_10 obj_26 obj_19)
       (pred_10 obj_26 obj_17)
       (pred_10 obj_06 obj_07)
       (pred_10 obj_06 obj_28)
       (pred_10 obj_06 obj_26)
       (pred_10 obj_07 obj_15)
       (pred_10 obj_07 obj_06)
       (pred_9 obj_12)
       (pred_9 obj_08)
       (pred_9 obj_03)
       (pred_1  obj_12 obj_13)
       (pred_1  obj_08 obj_05)
       (pred_1  obj_03 obj_13)
       (pred_5 obj_14)
       (pred_5 obj_01)
       (pred_5 obj_29)
       (pred_5 obj_23)
       (pred_5 obj_09)
       (pred_5 obj_04)
       (pred_5 obj_10)
       (pred_5 obj_16)
       (pred_5 obj_27)
       (pred_5 obj_02)
       (pred_5 obj_25)
       (pred_5 obj_20)
       (pred_5 obj_18)
       (pred_5 obj_30)
       (pred_5 obj_19)
       (pred_5 obj_28)
       (pred_5 obj_15)
       (pred_5 obj_21)
       (pred_5 obj_17)
       (pred_5 obj_26)
       (pred_5 obj_06)
       (pred_5 obj_07)

       (pred_11  obj_22 obj_13)
       (pred_11  obj_24 obj_05)
       (pred_11  obj_11 obj_05)
       (pred_2 obj_22 obj_25)
       (pred_2 obj_24 obj_30)
       (pred_2 obj_11 obj_27)
       (pred_8 obj_18)
    )

    (:goal (and
       (pred_2 obj_11 obj_25)
    ))
(:constraints
  (always (not (pred_8 obj_20)))
)
)

; plan
1. (op_5 obj_18 obj_30)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_30)
   goals met: 0 of 1
2. (op_2 obj_30 obj_24)
   deleted: (pred_2 obj_24 obj_30) (pred_6)
   added: (pred_12 obj_24)
   goals met: 0 of 1
3. (op_5 obj_30 obj_25)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_25)
   goals met: 0 of 1
4. (op_3 obj_25 obj_08 obj_24 obj_05)
   deleted: (pred_9 obj_08)
   added: (pred_5 obj_08)
   goals met: 0 of 1
5. (op_4 obj_25 obj_24)
   deleted: (pred_12 obj_24)
   added: (pred_6) (pred_2 obj_24 obj_25)
   goals met: 0 of 1
6. (op_5 obj_25 obj_08)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_08)
   goals met: 0 of 1
7. (op_5 obj_08 obj_10)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_10)
   goals met: 0 of 1
8. (op_5 obj_10 obj_16)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_16)
   goals met: 0 of 1
9. (op_5 obj_16 obj_27)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_27)
   goals met: 0 of 1
10. (op_2 obj_27 obj_11)
   deleted: (pred_2 obj_11 obj_27) (pred_6)
   added: (pred_12 obj_11)
   goals met: 0 of 1
11. (op_5 obj_27 obj_16)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_16)
   goals met: 0 of 1
12. (op_5 obj_16 obj_10)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_10)
   goals met: 0 of 1
13. (op_5 obj_10 obj_08)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_08)
   goals met: 0 of 1
14. (op_5 obj_08 obj_25)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_25)
   goals met: 0 of 1
15. (op_1 obj_25 obj_22 obj_11)
   deleted: (pred_12 obj_11) (pred_2 obj_22 obj_25)
   added: (pred_12 obj_22) (pred_2 obj_11 obj_25)
   goals met: 1 of 1
